import styled from "styled-components";

function ServiceTerms() {
  return (
        <Wrapper>
            <Contents>
<h1>서비스 이용약관</h1>
            <hr />
            <h2>제1장 총칙</h2>
            <h3>제1조 (목적)</h3>
            <p>
                본 약관은 이용자가 전기통신사업법 및 동법 시행령에 의하여
                See A Theater(이하 "회사"라 함)에서 제공하는 인터넷 관련 서비스를
                이용함에 있어 이용자와 회사의 권리·의무 및 책임사항을 규정함을
                목적으로 합니다.
            </p>
            <h3>제2조 (용어의 정의)</h3>
            <p>① 본 약관에서 사용하는 용어의 정의는 다음과 같습니다.</p>
            <ol style={{ listStyleType: 'decimal', paddingLeft: '20px' }}>
                <li>"이용자"란 본 약관에 따라 가입신청에 대한 회사의 승낙을 받아 회사가 제공하는 서비스를 이용하는 자를 말합니다.</li>
                <li>"이용계약"이란 서비스 이용과 관련하여 회사와 이용자 간에 체결하는 계약을 말합니다.</li>
                <li>"가입"이란 개인의 SNS 계정을 연동하고 본 약관에 동의하여 서비스 이용계약을 완료시키는 행위를 말합니다.</li>
                <li>"닉네임"이란 이용자의 식별과 서비스 이용을 위하여 이용자가 선정하는 문자와 숫자, 특수문자의 조합을 말합니다.</li>
                <li>"탈퇴"란 이용자가 서비스 이용계약을 종료시키는 의사표시입니다.</li>
            </ol>
            <h3>제3조 (약관의 공지 및 준용)</h3>
            <p>① 본 약관의 내용은 서비스 화면에 게시하거나 기타의 방법으로 이용자에게 공지함으로써 효력이 발생합니다.</p>
            <p>② 회사는 본 약관을 변경할 수 있으며, 변경된 약관은 제1항과 같은 방법으로 공지함으로써 효력이 발생합니다.</p>
            <h3>제4조 (약관 외 준칙)</h3>
            <p>① 본 약관에 명시되자 않은 사항은 전기통신기본법, 전기통신사업법 및 기타 관련법령의 규정에 의거합니다.</p>
            
            <h2>제2장 서비스 이용계약</h2>
            <h3>제1조 (이용계약의 성립)</h3>
            <p>① 이용자가 개인 SNS를 연동하고 닉네임을 입력한 후 가입 버튼을 누름과 동시에 이 약관에 동의하는 것으로 간주되며, 이용계약이 성립됩니다. 따라서 본인이 소유하고 있는 SNS 채널 중 회사와 제휴된 채널의 개인 계정정보를 이용하여 서비스를 이용할 수 있으며, 그 과정에서 이메일을 제외한 개인정보는 일체 수집하지 않음을 알려드립니다.</p>
            <h3>제2조 (계약의 해지 및 이용제한)</h3>
            <p>① 이용자가 서비스 이용계약을 해지하고자 하는 경우에는 본인이 프로필 수정 페이지를 통하여 회원탈퇴를 진행하여야 합니다.</p>
            <p>② 회원이 사망한 때는 회원자격을 상실합니다.</p>

            <h2>제3장 계약 당사자의 의무 </h2>
            <h3>제1조 (회원정보 관리에 대한 의무)</h3>
            <p>① 서비스 이용에 사용되는 개인 소유의 SNS 채널 계정 정보의 관리 책임은 이용자에게 있습니다. 이를 소홀히 관리하여 발생하는 서비스 이용 상의 손해 또는 제3자에 의한 부정이용 등에 대한 책임은 이용자에게 있으며 회사는 그에 대한 책임을 일절 지지 않습니다.</p>
            <p>② 자신의 회원정보가 부정하게 사용된 경우, 이용자는 반드시 회사 관계자에 그 사실을 통보해야 합니다.</p>
            <p>③ 닉네임은 영문/ 숫자/ 국문/ 특수문자를 포함할 수 있으며, 10자 이내로 지정해야합니다.</p>

            <h2>제2조 (이용자의 의무)</h2>
            <p>① 이용자는 관 관계법령, 이 약관의 규정, 이용안내 및 주의사항 등 회사가 통지하는 사항을 준수하여야 하며, 기타 회사의 서비스에 방해되는 행위를 하여서는 안 됩니다.</p>
            <p>② 이용자는 회사 관계자의 사전 승낙 없이 본 서비스를 이용하여 어떠한 영리 행위를 할 수 없습니다.</p>
            <p>③ 이용자는 서비스를 이용하여 얻은 정보를 회사 관계자의 사전 승낙 없이 복사, 복제, 변경, 번역, 출판, 방송, 기타의 방법으로 사용하거나 이를 타인에게 제공할 수 없습니다.</p>
            <p>④ 이용자는 서비스 이용과 관련하여 다음 각 호의 행위를 해서는 안됩니다.</p>
            <ol>
                <li>다른 이용자의 닉네임을 부정사용하는 행위</li>
                <li>한 명의 이용자가 다수의 아이디를 사용하는 행위</li>
                <li>범죄행위를 목적으로 하거나 기타 범죄행위와 관련된 행위</li>
                <li>선량한 풍속, 기타 사회질서를 해하는 행위</li>
                <li>해킹행위 또는 컴퓨터바이러스의 유포행위</li>
                <li>타인의 의사에 반하여 광고성 정보 등 일정한 내용을 지속적으로 게시하는 행위</li>
                <li>서비스의 안정적인 운영 또는 정상적인 이용에 지장을 주거나 줄 우려가 있는 일체의 행위</li>
                <li>관계법령에 위배되는 행위</li>
                <li>기타 회사 서비스 운영상 부적절하다고 판단하는 행위</li>
            </ol>
            <h2>제4장 서비스 이용</h2>
            <h3>제1조 (서비스의 요금)</h3>
            <p>① 회사가 제공하는 서비스는 무료입니다.</p>
            <p>② 소극장 등록 등의 서비스만 유료이며, 그 자세한 내용에 대하여는 이용자와 별도로 합의 합니다.</p>
            <h3>제2조 (이용자의 게시물)</h3>
            <p>① 회사 관계자는 이용자의 글을 임의대로 삭제하지 않습니다. 관계자는 이용자가 게시하거나 등록하는 서비스 내의 내용물이 다음 각 호에 해당한다고 판단되는 경우에만 사전통지 없이 이동 및 수정을 할 수 있습니다.</p>
            <ol>
                <li>다른 이용자 또는 제3자의 명예를 손상시키거나 불이익을 주는 행위를 한 경우</li>
                <li>게시물이 기술적인 오류로 이용자의 정상적인 이용에 방해를 주는 경우</li>
                <li>공공질서 및 범죄적 행위에 결부된다고 객관적으로 인정되는 내용일 경우</li>
                <li>게시판의 성격에 맞지 않는 경우</li>
                <li>특정 이용자를 비방, 음해하는 경우</li>
                <li>기타 회사의 운영 목적에 위배되는 경우</li>
            </ol>
            <h3>제3조 (게시물의 저작권)</h3>
            <p>① 게시물에 게재된 자료에 대한 권리는 다음 각 호와 같습니다.</p>
            <ol>
                <li>게시물에 대한 책임은 게시자에게 있으며, 회사는 서비스 내에 회원의 게시물을 게재할 권한이 있습니다.</li>
                <li>이용자는 서비스를 이용하여 얻은 정보를 가공, 판매하는 행위 등 서비스에 게재된 자료를 회사 이외의 곳에서 사용할 수 없습니다.</li>
            </ol>
            <h3>제4조 (서비스 이용시간)</h3>
            <p>① 서비스의 이용은 회사 관계자의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴 1일 24시간을 원칙으로 합니다. 다만, 정기 점검 등의 필요로 회사 관계자가 정한 날이나 시간은 예외로 합니다.</p>
            <p>② 회사 관계자는 서비스를 일정 범위로 분할하여 각 범위 별로 이용 가능 시간을 별도로 정할 수 있으며 이 경우 그 내용을 사전에 공지합니다.</p>
            <h3>제5조 (서비스 제공의 중지)</h3>
            <p>① 회사 관계자은 다음 각 호에 해당하는 경우 서비스 제공을 중지할 수 있습니다.</p>
            <ol>
              <li>서비스용 설비의 보수 등 공사로 인한 부득이한 경우</li>  
              <li>전기통신사업법에 규정된 기간통신사업자가 전기통신서비스를 중지했을 경우</li>
              <li>천재지변으로 인한 사고로 전기통신서비스를 중지했을 경우</li>
            </ol>
            <p>② 회사 관계자는 국가비상사태, 정전, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 때에는 서비스의 전부 또는 일부를 제한하거나 정지할 수 있습니다.</p>
        <h2>제5장 제재 및 이용제한</h2>
        <h3>제1조 (탈퇴 및 이용제한)</h3>
        <p>① 탈퇴는 언제든지 프로필 수정 페이지에서 가능합니다.</p>
        <p>② 탈퇴 후 게시한 글은 자동으로 삭제되지 않으며 운영자의 계정에 귀속됩니다.</p>
        <p>③ 제4장 제2조 조항을 3번 이상 위반하는 이용자의 경우 사전 통보 없이 탈퇴될 수 있으며 이 경우 해당 게시글은 자동으로 삭제됩니다.</p>
        <h2>제6장 기타</h2>
        <h3>제1조 (저작권의 귀속 및 이용제한)</h3>
        <p>① 회사가 작성한 서비스에 관한 저작권 및 기타 지적재산권은 회사에 귀속됩니다.</p>
        <p>② 이용자는 서비스를 이용함으로써 얻은 정보를 회사의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나, 제3자에게 이용하게 하여서는 안 됩니다. (단, 이용자가 사적으로 이용하는 경우는 제외.)</p>
        <p>③ 이용자가 작성한 게시물에 대한 모든 권리 및 책임은 이를 게시한 이용자에게 있습니다.</p>
        <h3>제2조 (컨텐츠 이용)</h3>
        <p>① 회사의 모든 형태의 콘텐츠는 지적재산권의 보호를 받습니다. 사전에 회사 혹은 회사에 콘텐츠를 제공한 제공처와의 사전 승인 없이 어떠한 경우라도 대여, 배포, 판매, 대출 행위가 금지되어 있습니다.</p>
        <p>② 회사에서 서비스되는 모든 형태의 콘텐츠의 내용을 인용 또는 발췌, 복제, 개조, 수정하여 상업적인 목적으로 다수를 대상으로 배포되는 행위, 사전 동의 없이 일부 내용을 발췌 또는 인용한 후 특정 페이지로 링크하는 행위는 금지되어 있 습니다. 다만 회사 관계자의 사전 동의 후 그 내용의 인용이 가능합니다.</p>
        <p>③ 회사의 콘텐츠 중 회사의 자체 콘텐츠가 아니며 별도로 제공처가 표기된 콘텐츠에 대해서는 모든 법적 책임이 내용을 제공한 제공처에 있으며 회사는 해당 콘텐츠에 대한 법적 책임이 없습니다.</p>
        <h3>제3조 (손해배상)</h3>
        <p>① 회사는 무료로 제공되는 서비스와 관련하여 이용자에게 어떠한 손해가 발생하더라도 손해가 회사의 중대한 과실에 의한 경우를 제외하고 이에 대하여 책임을 부담하지 아니합니다.</p>
        <h3>제4조 (면책)</h3>
        <p>① 회사는 이용자가 서비스에 게재한 정보, 자료, 사실의 정확성, 신뢰성 등 그 내용에 관하여는 어떠한 책임을 부담하지 아니하고, 이용자는 본인 책임 아래 서비스를 이용하며, 서비스를 이용하여 게시 또는 전송한 자료 등에 관하여 손해가 발생하거나 자료의 취사선택, 기타 서비스 이용과 관련하여 어떠한 불이익이 발생하더라도 이에 대한 모든 책임은 이용자에게 있습니다.</p>
        <p>② 회사가 제공하는 정보와 자료는 거래의 목적으로 이용될 수 없습니다. 따라서 본 서비스의 정보와 자료 등에 근거한 거래는 전적으로 이용자 자신의 책임과 판단 아래 수행되는 것이며, 회사는 이용자가 서비스의 이용과 관련하여 기대하는 이익에 관하여 책임을 부담하지 않습니다.</p>
        <p>③ 이용자 아이디(ID)와 비밀번호의 관리 및 이용 상의 부주의로 인하여 발생되는 손해 또는 제3자에 의한 부정사용 등에 대한 책임은 모두 이용자에게 있습니다.</p>
        <h3>제5조 (분쟁의 해결)</h3>
        <p>① 회사 관계자와 이용자는 서비스와 관련하여 발생한 분쟁을 원만하게 해결하기 위하여 필요한 모든 노력을 하여야 합니다.</p>
        <p>② 제1항의 규정에도 불구하고, 동 분쟁으로 인하여 소송이 제기될 경우 동 소송은 회사의 관계자가 재학/졸업한 홍익대학교를 관할하는 법원의 관할로 합니다.</p>
        <br/>
        <p>이 약관은 서비스화면에 개제한 후 즉시 시행합니다.</p>
        <p>시행일 2025-08-20</p>
            </Contents>
            
        </Wrapper>
    ); 
}
export default ServiceTerms;

const Wrapper = styled.div`
display: flex;
flex:1;
flex-direction: row;
justify-content: center;
`;
const Contents = styled.div`
padding: 40px;
@media (min-width: 768px) {

		max-width: 800px;
	}

    font: Pretendard;
    h1 {
        margin-top: 20px;
        margin-bottom: 20px;
    }
    h2{
        margin-top: 20px;
        margin-bottom: 10px;
    }
    h3 {
        margin-top: 20px;
        margin-bottom: 10px;
    }
    p {
    color: #696969;
    font-size: 16px;
    font-weight: 500;
    line-height: 22px;
    paragraph-spacing: 3px;
    letter-spacing: -3%;
    margin-bottom: 10px;
    }
    ol {
    list-style-type: decimal;
    padding-left: 20px;}
    li {
        color: #696969;
    font-size: 16px;
    font-weight: 500;
    line-height: 22px;
    paragraph-spacing: 3px;
    letter-spacing: -3%;
    margin-bottom: 10px;
    }
`;